content/index.org
* [[./index.org][*Java*]]
* ЁЯУЪ Java р╕Бр╣Ир╕нр╕Щр╕Бр╕ер╕▓р╕Зр╕ар╕▓р╕Д

#+HTML: <a href="./assets/java-cheatsheet.pdf" class="download-btn" download>Download PDF ЁЯУД</a>
** [[./variable-and-datatypes.org][ЁЯУМ Variable and Data Types]]
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТА
** [[./operations-packages-and-programming-styles.org][ЁЯУМ Operations, Packages and Programming Styles]]
** [[./method.org][ЁЯУМ Methods]]
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТА
** [[./control-statements.org][ЁЯУМ Control Statements]]
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТА
** [[./arrays.org][ЁЯУМ Arrays]]
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТАЁЯТАЁЯТА

** P.S.
ЁЯТА р╕Др╕╖р╕н р╕Ыр╕гр╕░р╣Ар╕бр╕┤р╕Щр╕Ир╕▓р╕Бр╕Др╕зр╕▓р╕бр╕вр╕▓р╕Бр╣Ар╕Хр╣Зр╕б ЁЯТА x 10 р╣Вр╕Фр╕вр╕Юр╕┤р╕Ир╕▓р╕гр╕Ур╕▓р╕Ир╕▓р╕Бр╕зр╕┤р╕Ир╕▓р╕гр╕Ур╕Нр╕▓р╕Ур╕Вр╕нр╕Зр╣Ар╕Ир╣Йр╕▓р╕Вр╕нр╕Зр╕Ър╕ер╣Зр╕нр╕Б
- ЁЯТА x 1 р╕лр╕бр╕▓р╕вр╕Цр╕╢р╕З р╣Др╕бр╣Ир╕вр╕▓р╕Б р╣Бр╕Хр╣Ир╕нр╕вр╣Ир╕▓р╕Юр╕ер╕▓р╕Ф (р╕Др╕зр╕гр╕Ир╕│)
- ЁЯТАЁЯТАЁЯТАЁЯТА р╕лр╕бр╕▓р╕вр╕Цр╕╢р╕З р╕вр╕▓р╕Бр╕Ыр╕▓р╕Щр╕Бр╕ер╕▓р╕З (р╣Др╕бр╣Ир╣Ар╕Бр╕╡р╣Ир╕вр╕зр╕Бр╕▒р╕Ър╕Др╕зр╕▓р╕бр╕кр╕│р╕Др╕▒р╕Н //р╕Юр╕┤р╕Ир╕▓р╕гр╕Ур╕▓р╕Бр╕▒р╕Щр╣Ар╕нр╕З)
