public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="readtheorg.css" />
<link rel="stylesheet" href="rethink_inline.css" />
<link rel="stylesheet" href="src.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc2766bb"><b>Java</b></a></li>
<li><a href="#orge8f57e6">ЁЯУЪ Java р╕Бр╣Ир╕нр╕Щр╕Бр╕ер╕▓р╕Зр╕ар╕▓р╕Д</a>
<ul>
<li><a href="#orgb71d4ff">ЁЯУМ Variable and Data Types</a></li>
<li><a href="#org15731ed">ЁЯУМ Operations, Packages and Programming Styles</a></li>
<li><a href="#orge20174e">ЁЯУМ Methods</a></li>
<li><a href="#orgfcb4bcc">ЁЯУМ Control Statements</a></li>
<li><a href="#orga24e46a">ЁЯУМ Arrays</a></li>
<li><a href="#orgc2ff94a">P.S.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2766bb" class="outline-2">
<h2 id="orgc2766bb"><a href="./index.html"><b>Java</b></a></h2>
</div>
<div id="outline-container-orge8f57e6" class="outline-2">
<h2 id="orge8f57e6">ЁЯУЪ Java р╕Бр╣Ир╕нр╕Щр╕Бр╕ер╕▓р╕Зр╕ар╕▓р╕Д</h2>
<div class="outline-text-2" id="text-orge8f57e6">
</div>
<div id="outline-container-orgb71d4ff" class="outline-3">
<h3 id="orgb71d4ff"><a href="./variable-and-datatypes.html">ЁЯУМ Variable and Data Types</a></h3>
<div class="outline-text-3" id="text-orgb71d4ff">
<p>
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТА
</p>
</div>
</div>
<div id="outline-container-org15731ed" class="outline-3">
<h3 id="org15731ed"><a href="./operations-packages-and-programming-styles.html">ЁЯУМ Operations, Packages and Programming Styles</a></h3>
</div>
<div id="outline-container-orge20174e" class="outline-3">
<h3 id="orge20174e"><a href="./method.html">ЁЯУМ Methods</a></h3>
<div class="outline-text-3" id="text-orge20174e">
<p>
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТА
</p>
</div>
</div>
<div id="outline-container-orgfcb4bcc" class="outline-3">
<h3 id="orgfcb4bcc"><a href="./control-statements.html">ЁЯУМ Control Statements</a></h3>
<div class="outline-text-3" id="text-orgfcb4bcc">
<p>
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТА
</p>
</div>
</div>
<div id="outline-container-orga24e46a" class="outline-3">
<h3 id="orga24e46a"><a href="./arrays.html">ЁЯУМ Arrays</a></h3>
<div class="outline-text-3" id="text-orga24e46a">
<p>
р╕Др╕зр╕▓р╕бр╕вр╕▓р╕Б: ЁЯТАЁЯТАЁЯТАЁЯТА
</p>
</div>
</div>

<div id="outline-container-orgc2ff94a" class="outline-3">
<h3 id="orgc2ff94a">P.S.</h3>
<div class="outline-text-3" id="text-orgc2ff94a">
<p>
ЁЯТА р╕Др╕╖р╕н р╕Ыр╕гр╕░р╣Ар╕бр╕┤р╕Щр╕Ир╕▓р╕Бр╕Др╕зр╕▓р╕бр╕вр╕▓р╕Бр╣Ар╕Хр╣Зр╕б ЁЯТА x 10 р╣Вр╕Фр╕вр╕Юр╕┤р╕Ир╕▓р╕гр╕Ур╕▓р╕Ир╕▓р╕Бр╕зр╕┤р╕Ир╕▓р╕гр╕Ур╕Нр╕▓р╕Ур╕Вр╕нр╕Зр╣Ар╕Ир╣Йр╕▓р╕Вр╕нр╕Зр╕Ър╕ер╣Зр╕нр╕Б
</p>
<ul class="org-ul">
<li>ЁЯТА x 1 р╕лр╕бр╕▓р╕вр╕Цр╕╢р╕З р╣Др╕бр╣Ир╕вр╕▓р╕Б р╣Бр╕Хр╣Ир╕нр╕вр╣Ир╕▓р╕Юр╕ер╕▓р╕Ф (р╕Др╕зр╕гр╕Ир╕│)</li>
<li>ЁЯТАЁЯТАЁЯТАЁЯТА р╕лр╕бр╕▓р╕вр╕Цр╕╢р╕З р╕вр╕▓р╕Бр╕Ыр╕▓р╕Щр╕Бр╕ер╕▓р╕З (р╣Др╕бр╣Ир╣Ар╕Бр╕╡р╣Ир╕вр╕зр╕Бр╕▒р╕Ър╕Др╕зр╕▓р╕бр╕кр╕│р╕Др╕▒р╕Н //р╕Юр╕┤р╕Ир╕▓р╕гр╕Ур╕▓р╕Бр╕▒р╕Щр╣Ар╕нр╕З)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
